In [1]:
import pandas as pd
import numpy as np

In [6]:
singled_dataframe = pd.DataFrame(np.arange(1,10))

In [5]:
singled_dataframe

     0
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14
14  15
15  16
16  17
17  18
18  19

In [8]:
#Access 1st row
singled_dataframe.iloc[0]

0    1
Name: 0, dtype: int64

In [9]:
#Access 6th row
singled_dataframe.iloc[5]

0    6
Name: 5, dtype: int64

In [22]:
#Access rows 1 to 5 [start:stop:step]
singled_dataframe.iloc[0:5]

   0
0  1
2  3
4  5

In [23]:
#Access alternate rows from 1 to 5 [start:stop:step]
singled_dataframe.iloc[0:5:2]

   0
0  1
2  3
4  5

In [20]:
#Access all but n rows
singled_dataframe.iloc[:-1]
singled_dataframe.iloc[:-2]

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [21]:
#Reverse your dataframe
singled_dataframe.iloc[::-1]

   0
8  9
7  8
6  7
5  6
4  5
3  4
2  3
1  2
0  1

In [24]:

river_dict = {'river': ['Missouri', 'Mississippi', 'Yukon', 'Rio Grande', 'Arkansas'],
        'length': [2341, 2202, 1979, 1759, 1450],
        'state': ['Montana', 'Minnesota', 'British Columbia', 'Colorado', 'Kansas']}
river_frame =pd.DataFrame(river_dict, columns=['river', 'length', 'state'])

In [25]:
river_frame

         river  length             state
0     Missouri    2341           Montana
1  Mississippi    2202         Minnesota
2        Yukon    1979  British Columbia
3   Rio Grande    1759          Colorado
4     Arkansas    1450            Kansas

In [26]:
#Access all rows and columns
river_frame.iloc[:, :]

         river  length             state
0     Missouri    2341           Montana
1  Mississippi    2202         Minnesota
2        Yukon    1979  British Columbia
3   Rio Grande    1759          Colorado
4     Arkansas    1450            Kansas

In [27]:

#Access 2nd column of all rows
river_frame.iloc[:, 1]

0    2341
1    2202
2    1979
3    1759
4    1450
Name: length, dtype: int64

In [28]:
#Access 2nd, 3rd column of all rows
river_frame.iloc[:, 1:3]

   length             state
0    2341           Montana
1    2202         Minnesota
2    1979  British Columbia
3    1759          Colorado
4    1450            Kansas

In [29]:
#Access last column
river_frame.iloc[:, -1]

0             Montana
1           Minnesota
2    British Columbia
3            Colorado
4              Kansas
Name: state, dtype: object

In [30]:
#Access 2nd, 3rd row and 1st, 2nd column
river_frame.iloc[1:3, 0:2]

         river  length
1  Mississippi    2202
2        Yukon    1979